print("----欢迎使用Minercraft攻略----")
a = input("继续请键入回车: ")
print(a)
print("作者介绍:其实作者很怕蜘蛛的,嘿嘿")
pass
pass
print()
print()
print("-----我-----是-----分-----割-----线-----")
print("那么我先讲解一下生存模式下防止怪物在房子周围游动导致玩家无法入睡，并能有效挡住怪物和被伤害的几率")
print("我们先搭建好自己的房子,然后以房子为中心向周围挖距离约4格的宽度然后向下挖3格，这个坑的外围是以房子为中心的第6格然后放上水,这样怪物判断这里有水就不会过来了")
b = input("如果想知道这个答案是不是万能的请键入回车键: ")
print(b)
print("是万能的,嘿嘿，别忘了给周围放上火把哦！")
c = input("想知道更多的请关注我并且键入回车: ")
print(c)
print("想知道作者怎么联系吗,或许你能找到答案")
d = input()
print(d)
print("邮箱:m13619199464@163.com,知道后不要骚扰我哦,嘿嘿")


